Repository: Private-Net-work/Private-Net.work-site
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Bad request
ru: Ошибка в запросе

source: 400 description
ru: Вы передали в запросе некорректные данные и сервер не смог их обработать. <br>Если Вы считаете, что так произошло по нашей вине, свяжитесь с администратором сайта по контактам, указанным ниже.

source: Forbidden
ru: Доступ запрещён

source: 403 description
ru: У Вас нет прав для просмотра этой страницы. <br>Если Вы считаете, что так произошло по нашей вине, свяжитесь с администратором сайта по контактам, указанным ниже.

source: Not found
ru: Страница не найдена

source: 404 description
ru: Нам не удалось найти страницу, которую Вы пытаетесь открыть. Возможно, она была удалена. <br>Если Вы считаете, что так произошло по нашей вине, свяжитесь с администратором сайта по контактам, указанным ниже.

source: Unallowed method
ru: Недопустимый метод

source: 405 description
ru: Метод %(method)s, который Вы используете, не должен быть использован для открытия этой страницы.

source: Internal Server Error
ru: Внутренняя ошибка сервера

source: 500 description
ru: Поздравляем! Вам удалось сломать наш сайт :) <br>А если серьёзно, то у нас произошла какая-то непредвиденная ошибка. <br>Пожалуйста, свяжитесь с администратором сайта по контактам, указанным ниже. Постараемся всё исправить.

source: link info
ru: Скопируйте ссылку на записку и отправьте своему собеседнику

source: js 400 error
ru: Произошла неизвестная ошибка (400). Пожалуйста, свяжитесь с администратором сайта по email errors@private-net.work и расскажите об этой проблеме. Приносим извинения за доставленные неудобства.

source: js 500 error
ru: Внутренняя ошибка сервера (500). Пожалуйста, свяжитесь с администратором сайта по email errors@private-net.work и расскажите об этой проблеме. Приносим извинения за доставленные неудобства.

source: js unknown error
ru: Произошла неизвестная ошибка. Пожалуйста, расскажите об этой проблеме администратору сайта по email errors@private-net.work. Приносим извинения за доставленные неудобства.

source: heavy doc
ru: Размер документа слишком велик (Допускается до 2 МБ)

source: heavy content
ru: Содержимое записки слишком большое

source: js save data
ru: Сохраните все нужные данные. Открыть их здесь больше не получится.

source: js already read
ru: Эта записка уже была просмотрена. Похоже, что это произошло пока Вы не подтверждали открытие записки. Код ошибки: 404.

source: download file
ru: Скачать документ

source: construction description
ru: Мы проводим обновление сайта. Совсем скоро всё заработает, но придётся немного подождать. Приносим извинения за доставленные неудобства!

source: Internal server error
ru: Внутренняя ошибка сервера

source: about description
ru: Узнайте, как работает сайт одноразовых записок, чтобы скрыть данные от третьих лиц при передаче в мессенджерах

source: about title
ru: Как это работает

source: nav create note
ru: Новая записка

source: nav about
ru: Как это работает

source: about main heading
ru: Как это работает

source: about service description
ru: <p> Мы представляем сервис, который поможет скрыть самые приватные данные от просмотра третьими лицами при передаче одному собеседнику. Вместо того, чтобы отправлять пароли, платёжные данные, адреса и другие чувствительные к перехвату данные в открытом виде в мессенджерах, отправляйте собеседнику ссылку на одноразовую записку, сгенерированную этим сайтом. </p> <p> После первого просмотра записки по ссылке, она удаляется на нашем сервере. Это означает, что если Ваш собеседник будет первым, кто откроет записку, то после него уже никто не сможет узнать, что было в записке. А если кто-то (например, спецслужбы) прочитают записку вперёд собеседника, то он, как минимум, об этом узнает, когда не сможет её открыть. </p>

source: articles heading
ru: Ссылки

source: article formatting link
ru: Как делается форматирование записки

source: source code link
ru: Исходный код сайта

source: faq heading
ru: Ответы на часто задаваемые вопросы

source: faq can-admins-see-note-content heading
ru: Могут ли администраторы сайта или хостинг-провайдеры видеть содержимое записок?

source: faq sharing-decrypted-note-content heading
ru: Может ли сайт перехватить содержимое записки пока она находится в расшифрованном виде и передать его кому-то?

source: faq note-data heading
ru: Что вам известно о записке, кроме её содержания?

source: faq storing-ip heading
ru: Храните ли Вы ip-адреса посетителей?

source: faq stats heading
ru: Какую статистику Вы собираете?

source: faq ads heading
ru: Будет ли на этом сайте реклама? Как вообще вы зарабатываете на этом сайте?

source: copy link
ru: Скопировать ссылку

source: faq can-admins-see-note-content 1
ru: <p> Нет, все записки хранятся в зашифрованном виде. Шифруется записка в браузере того, кто её создавал. Для этого используется секретный ключ, сгенерированный этим же браузером. Затем этот ключ передаётся собеседнику в самой ссылке после символа "#" и используется его браузером для расшифровки содержимого записки с сервера. </p> <p> При открытии ссылки никакие символы после "#" (то есть сам секретный ключ) также не передаются на сервер. Эта часть ссылки называется якорем и обыкновенно используется браузером для навигации по блокам на странице. </p>

source: faq can-admins-see-note-content 2
ru: <p> Таким образом, мы не обрабатываем никаких данных, содержащихся в записке, кроме её зашифрованного содержимого, которое не сможем расшифровать, так как не знаем ни Вашей ссылки, ни секретного ключа. </p> <p> Кстати, если Вы знаете, как смотреть запросы браузера через инструменты разработчика, то можете сами посмотреть, как шифруются записки, и что именно отправляется на наш сервер. </p>

source: faq sharing-decrypted-note-content
ru: <p> Нет, сайт не передаёт никому расшифрованного содержимого записки. Все запросы, которые он делает можно посмотреть через средства разработчика. Все необходимые для работы сайта библиотеки и javascript-скрипты хранятся непосредственно на нашем сервере. Мы специально не используем ничего, что хранится на других сайтах и CDN, чтобы быть уверенными, что всё, что мы используем, не собирает данные с нашего сайта, открытые в браузерах наших пользователей. Это наша положительная отличительная черта от конкурентных сервисов. </p>

source: faq note-data
ru: <p> Когда Вы создаёте записку, мы не связываем с ней ни Вас, ни того, кто её получит. Мы считаем своим долгом хранить только самый необходимый минимум данных. </p> <p> В связи с тем, что велико количество записок, которые никто никогда не читает, нам пришлось установить период, в течении которого записки в любом случае удаляются. Чтобы нельзя было идентифицировать создателя записки по дате её написания, мы решили хранить только дату, к которой она должна быть удалена, предоставляя возможность пользователям самим выбирать, как долго она будет храниться. По умолчанию, записки удаляются через 7 дней. </p> <p> Сейчас в базе данных каждой записке соответствуют 4 поля: <i>её идентификатор, зашифрованное содержимое, дата, к которой она будет удалена, если её не прочитают до этого и счетчик (также необходимый для расшифровки)</i>. Вот так выглядит одна из тестовых записок в базе данных: </p>

source: faq storing-ip
ru: <p> Мы стараемся не собирать информацию о своих посетителях. Ip-адрес — это тоже информация о посетителе, по которой можно его идентифицировать. Поэтому в своих основных журналах запросов к сайту мы храним только <abbr title='Хеш — функция, которая позволяет "зашифровать" строку без возможности расшифровки. Одинаковые строки имеют одинаковые значения хешей. Поэтому, используя хеш ip-адреса, мы можем понять, где он был одинаковый, а где — разный, но не можем узнать сам ip-адрес.'>хеш</abbr> от ip-адреса, чтобы отличать разных посетителей, когда мы осуществляем поиск ошибок в работе нашего сайта. Ещё хеш ip-адреса используеся в наших антиспам-системах для защиты от ботов и злоумышленников, которые иногда пытаются создавать записки в неограниченных количествах. </p>

source: faq stats
ru: <p> У нас есть всего 2 счётчика: количество созданных записок и количество прочитанных. Время от времени мы смотрим на эти счётчики. Этого хватает, чтобы понять, насколько активно используется наш сайт, а иногда и вовремя обратить внимание на спам-атаку. Мы не используем никаких внешних способов аналитики, вроде Яндекс.Метрики. Причину этого мы рассказали <a href="#sharing-decrypted-note-content">вот здесь</a>. </p>

source: faq ads
ru: <p> Этот сайт изначально был создан в личных целях. Мы используем его так же, как и Вы. Мы не ставили себе цель извлечения прибыли. Конечно, если мы наберём большую аудиторию, то монетизация скорее всего будет рассматриваться. Но мы вряд ли будем когда-либо прибегать к использованию рекламы Google и других подобных сервисов. О причинах тому мы писали <a href="#sharing-decrypted-note-content">вот здесь</a>. Скорее, мы сделаем возможность рекламодателям заказывать размещение рекламы напрямую у нас, и сами будем настраивать отображение и внешний вид рекламных баннеров на своём сайте. <i>Но самый вероятный и наиболее безобидный на наш взгляд способ монетизации — это добровольные пожертвования.</i> </p>

source: did not get answer
ru: Не нашли ответ на свой вопрос?

source: write us link
ru: Напишите нам!

source: lang code
ru: ru

source: site keywords
ru: private network, private net, private network notes, одноразовые записки, приватное общение, самоуничтожаемые сообщения, удаляющиеся записки, безопасная передача данных, защита данных от третьих лиц, privacy, security, disposable notes

source: enable js heading
ru: Включите JavaScript!

source: enable js description
ru: Пользование этим сайтом без включенного JavaScript невозможно! Если Ваш браузер не поддерживает JavaScript или Вы не знаете, что это такое, установите последнюю версию Chrome или Firefox.

source: contacts
ru: Контакты

source: donate
ru: Поддержать

source: lang alt
ru: <a href='' onclick="change_lang('en')">English</a>

source: site description
ru: Private-Net.work — это сервис, который поможет скрыть самые приватные данные от просмотра третьими лицами при передаче в мессенджерах. Вместо того, чтобы отправлять важные данные в открытом виде, отправляйте ссылку на одноразовую записку, сгенерированную этим сайтом. После первого прочтения записки бесследно удаляются. А мы не сможем узнать их содержание, так как оно шифруется браузером.

source: %(sitename)s
ru: %(sitename)s — одноразовые записки для безопасной передачи важных данных

source: create note h1 header
ru: Новая записка

source: ad banner header
ru: Создайте одноразовую записку, которая уничтожится после первого прочтения.

source: ad banner description
ru: Передавайте важные данные в мессенджерах, используя ссылки на записки, чтобы третьи лица не смогли их узнать!

source: ad banner act link
ru: Подробнее...

source: ad banner do not show again
ru: Больше&nbsp;не&nbsp;показывать

source: note content placeholder
ru: Текст записки

source: advanced options
ru: Дополнительные&nbsp;параметры

source: also delete in
ru: В любом случае удалить записку через

source: 7 days
ru: 7 дней

source: 2 days
ru: 2 дня

source: 1 day
ru: 1 день

source: 12 hours
ru: 12 часов

source: 2 hours
ru: 2 часа

source: 1 hour
ru: 1 час

source: 30 minutes
ru: 30 минут

source: 15 minutes
ru: 15 минут

source: 5 minutes
ru: 5 минут

source: file input label
ru: Отправьте файл (вместо текста записки)

source: create note btn
ru: Создать записку

source: donate banner header
ru: Поддержите наш проект!

source: donate banner description
ru: Пожертвование можно сделать при помощи следующих криптовалют: <i>Bitcoin, Ethereum, Tether, USDCoin, BNB, XRP, DAI, Binance USD, Dogecoin, Tron, Monero, Litecoin, SHIBA INU, Cardano</i>

source: support page title
ru: Контакты

source: donate heading
ru: Поддержать проект

source: formatting description
ru: Узнайте, как делается форматирование одноразовой записки, чтобы надёжно передавать данные в удобном виде

source: formatting title
ru: Форматирование записок

source: formatting bc about
ru: Как это работает

source: formatting bc articles
ru: Ссылки

source: formatting heading
ru: Как делается форматирование записки

source: formatting text
ru: Из соображений безопасности все символы в создаваемых записках экранируются. Однако, мы оставили возможность использовать некоторые теги HTML для форматирования Ваших записок и даже придумали свои. Это означает, что весь текст между открывающим и закрывающим тегом будет отформатирован определённым образом. Ниже приведена таблица, показывающая, какие теги за что отвечают.

source: link
ru: Ссылка

source: text
ru: Текст

source: formatting new line
ru: Перевод на новую строку

source: formatting example heading
ru: Пример отформатированной записки

source: formatting text heading
ru: Текст записки при её написании:

source: formatting text 1
ru: <lp>Привет, <i>друг</i>!</p>

source: formatting text 2
ru: В этой записке хочу передать тебе <u>данные для подключения к <b>системе</b></u>.<br>

source: formatting text 3
ru: <h3>Данные для <gspan>входа</span>:</h3>

source: formatting text 4
ru: <lp><i>Login:</i> <ms>admin</ms></p>

source: formatting text 5
ru: <lp><i>Password:</i> <ms>jd74nf720kg</ms></p>

source: formatting text 6
ru: <hr><b>Пожалуйста, сохрани пароль в <rspan> надёжном месте</span>, прежде чем закрывать записку.</b>

source: formatting text 7
ru: Подключиться к системе можно <a href="https://private-net.work">здесь</a>.

source: formatting example content heading
ru: Содержимое записки при просмотре:

source: formatting example content
ru: <p style="text-align: left"> Привет, <i>друг</i>! </p> <br> В этой записке хочу передать тебе <u>данные для подключения к <b>системе</b></u>. <br><br> <h3>Данные для <span style="color: green">входа</span>:</h3> <br> <p style="text-align: left"><i>Login:</i> <span class="user-select-all font-monospace">admin</span></p><br><p style="text-align: left"><i>Password:</i> <span class="user-select-all font-monospace">jd74nf720kg</span></p><br><hr style="height: 2px; color: black"><b>Пожалуйста, сохрани пароль в <span style="color: red">надёжном месте</span>, прежде чем закрывать записку.</b> <br> Подключиться к системе можно <a href="https://private-net.work">здесь</a>.

source: support heading
ru: Как с нами связаться?

source: support in
ru: Поддержка в

source: mail addresses
ru: Почтовые адреса

source: support email label
ru: Для Ваших вопросов и предложений:

source: support error email label
ru: По найденным ошибкам, багам и уязвимостям:

source: view note page title
ru: Просмотр записки

source: view note heading
ru: Одноразовая записка

source: view note warning header
ru: Посмотреть следующую информацию можно только 1 раз!

source: view note warning description
ru: Если Вы не сохраните нужные Вам данные, придется попросить отправителя отправить Вам новую записку. Вы уверены, что хотите посмотреть эту записку сейчас?

source: view note btn
ru: Да, уверен (-а)
